Catalogs/ГрафикиРаботыСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ГрафикиРаботыСотрудников</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоЧасов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособЗаполнения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШагДней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоГрафика</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокДней</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>День</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоЧасов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ГрафикРаботыПредприятия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ГрафикРаботыПредприятия</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КоличествоЧасов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>День</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>График</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботыСотрудников</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/ГрафикиРаботыСотрудников/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ЗаполнитьГрафик(Команда)
	Объект.СписокДней.Очистить();
	
	Если Объект.КоличествоЧасов < 1 Тогда 
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Нужно заполнить количество часов";
		Сообщение.Сообщить();
		Возврат
	Иначе 
	
		Если Объект.СпособЗаполнения = 1 Тогда 
			ЗаполнитьГрафикПятидневки();
		ИначеЕсли  Объект.СпособЗаполнения = 2 и Объект.ШагДней <1 Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Нужно заполнить шаг дней";
		Сообщение.Сообщить();
		Возврат
		
	ИначеЕсли Объект.СпособЗаполнения = 2 и Объект.ШагДней <>0 Тогда 
			ЗаполнитьЦиклическийГрафик();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ПроверкаКорректностиПериода()

	Если ЗначениеЗаполнено(Объект.КонецПериода) И Объект.НачалоПериода > Объект.КонецПериода Тогда 
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Начало периода не может быть больше окончания!";
		Сообщение.Сообщить();
		Объект.КонецПериода = '00010101';
	КонецЕсли;
	

КонецПроцедуры // ПроверкаКорректностиПериода()

&НаКлиенте
Процедура НачалоПериодаПриИзменении(Элемент)
	ПроверкаКорректностиПериода();
КонецПроцедуры

&НаКлиенте
Процедура КонецПериодаПриИзменении(Элемент)
	ПроверкаКорректностиПериода();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Объект.НачалоПериода = '00010101' и Объект.КонецПериода = '00010101' Тогда 
		Объект.НачалоПериода = НачалоГода(ТекущаяДата());
		Объект.КонецПериода = КонецГода(ТекущаяДата());
	КонецЕсли;
	
	//заполняем значения по умолчанию
	Если Объект.СпособЗаполнения = 0 Тогда 
		Объект.СпособЗаполнения = 1;
	КонецЕсли;

	
	Если Объект.НачалоГрафика = 0 Тогда 
		Объект.НачалоГрафика = 1;
	КонецЕсли;
	
	УправлениеВидимостью();
	
КонецПроцедуры


&НаКлиенте
Процедура УправлениеВидимостью()

	ЭтоЦикличныйГрафик = Объект.СпособЗаполнения = 2;
	Элементы.ШагДней.Видимость = ЭтоЦикличныйГрафик;
	Элементы.НачалоГрафика.Видимость = ЭтоЦикличныйГрафик;

КонецПроцедуры // УправлениеВидимостью()



&НаКлиенте
Процедура ЗаполнитьГрафикПятидневки()
	
    ЭтотГод = Год(Объект.НачалоПериода);
	СуткиВСекундах = 86400;
	ТекущийДень = Объект.НачалоПериода;
	
	Пока ТекущийДень <= Объект.КонецПериода Цикл 
		НоваяСтрока = Объект.СписокДней.Добавить();
		НоваяСтрока.День = ТекущийДень;
		
		ЭтоРабочийДень = (ДеньНедели(ТекущийДень)<6 И НеРабочиеДни(ТекущийДень) = Ложь) Или РабочиеДни(ТекущийДень)=Истина;
		
		Если ЭтоРабочийДень Тогда 
			НоваяСтрока.КоличествоЧасов = Объект.КоличествоЧасов - КороткиеДни(ТекущийДень);
		КонецЕсли;
		
		ТекущийДень = ТекущийДень + СуткиВСекундах;
		
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьГрафикПятидневки()


&НаКлиенте
Процедура ЗаполнитьЦиклическийГрафик()

	СуткиВСекундах = 86400;
	ТекущийДень = Объект.НачалоПериода;
	
	Если Объект.НачалоГрафика = 1 Тогда 
		ЭтоРабочийДень = Истина;
	Иначе
		ЭтоРабочийДень = Ложь;
	КонецЕсли;
	
    Счетчик = 0;
	
	Пока ТекущийДень <= Объект.КонецПериода Цикл 
		
		НоваяСтрока = Объект.СписокДней.Добавить();
		НоваяСтрока.День = ТекущийДень;
		
		Если ЭтоРабочийДень Тогда 
			НоваяСтрока.КоличествоЧасов =  Объект.КоличествоЧасов
		КонецЕсли;
		
		Счетчик = Счетчик + 1;
		ТекущийДень = ТекущийДень + СуткиВСекундах;
		
		Если Счетчик % Объект.ШагДней = 0 Тогда 
			ЭтоРабочийДень = Не ЭтоРабочийДень;
		КонецЕсли;
		
	КонецЦикла;
		
КонецПроцедуры // ЗаполнитьЦиклическийГрафик()

&НаКлиенте
Процедура СпособЗаполненияПриИзменении(Элемент)
	УправлениеВидимостью();
КонецПроцедуры

&НаКлиенте
Функция НеРабочиеДни(ЭтотДень)
	
	ЭтотГод = Год(Объект.НачалоПериода);
	Списоквыходных = Новый Массив;
	Списоквыходных.Добавить(Дата(ЭтотГод, 01, 01));
	Списоквыходных.Добавить(Дата(ЭтотГод, 01, 02));
	Списоквыходных.Добавить(Дата(ЭтотГод, 01, 03));
	Списоквыходных.Добавить(Дата(ЭтотГод, 01, 04));
	Списоквыходных.Добавить(Дата(ЭтотГод, 01, 05));
	Списоквыходных.Добавить(Дата(ЭтотГод, 01, 06));
	Списоквыходных.Добавить(Дата(ЭтотГод, 01, 07));
	Списоквыходных.Добавить(Дата(ЭтотГод, 01, 08));
	Списоквыходных.Добавить(Дата(ЭтотГод, 02, 23));
	Списоквыходных.Добавить(Дата(ЭтотГод, 03, 08));
	Списоквыходных.Добавить(Дата(ЭтотГод, 04, 29));
	Списоквыходных.Добавить(Дата(ЭтотГод, 04, 30));
	Списоквыходных.Добавить(Дата(ЭтотГод, 05, 01));
	Списоквыходных.Добавить(Дата(ЭтотГод, 05, 10));
	Списоквыходных.Добавить(Дата(ЭтотГод, 05, 09));
	Списоквыходных.Добавить(Дата(ЭтотГод, 11, 04));
	Списоквыходных.Добавить(Дата(ЭтотГод, 12, 30));
	Списоквыходных.Добавить(Дата(ЭтотГод, 12, 31));
	
	Индекс = Списоквыходных.Найти(ЭтотДень);
	
	Если Индекс = Неопределено Тогда 
		Возврат Ложь;
	Иначе 
		Возврат Истина;
	КонецЕсли;
	
КонецФункции // НеРабочиеДни()

&НаКлиенте
Функция КороткиеДни(ЭтотДень)
	
	ЭтотГод = Год(Объект.НачалоПериода);
	СписокКороткихДней = Новый Массив;
	СписокКороткихДней.Добавить(Дата(ЭтотГод, 02, 22));
	СписокКороткихДней.Добавить(Дата(ЭтотГод, 03, 07));
	СписокКороткихДней.Добавить(Дата(ЭтотГод, 05, 08));
	СписокКороткихДней.Добавить(Дата(ЭтотГод, 06, 11));
	СписокКороткихДней.Добавить(Дата(ЭтотГод, 11, 02));
	
	Индекс = СписокКороткихДней.Найти(ЭтотДень);
	
	Если Индекс = Неопределено Тогда 
		Возврат 0;
	Иначе 
		Возврат 1;
	КонецЕсли;

КонецФункции // КороткиеДни()

&НаКлиенте
Функция РабочиеДни(ЭтотДень)

	ЭтотГод = Год(Объект.НачалоПериода);
	СписокРабочихДней = Новый Массив;
	СписокРабочихДней.Добавить(Дата(ЭтотГод, 04, 27));
	СписокРабочихДней.Добавить(Дата(ЭтотГод, 11, 02));
	
   Индекс = СписокРабочихДней.Найти(ЭтотДень);
	
	Если Индекс = Неопределено Тогда 
		Возврат Ложь;
	Иначе 
		Возврат Истина;
	КонецЕсли;;
	


КонецФункции // РабочиеДни()



&НаСервере
Процедура ЗагрузитьВГрафикиПредприятияНаСервере()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ГрафикиРаботыСотрудниковСписокДней.Ссылка КАК Ссылка,
		|	ГрафикиРаботыСотрудниковСписокДней.День КАК День,
		|	ГрафикиРаботыСотрудниковСписокДней.КоличествоЧасов КАК КоличествоЧасов
		|ИЗ
		|	Справочник.ГрафикиРаботыСотрудников.СписокДней КАК ГрафикиРаботыСотрудниковСписокДней
		|ГДЕ
		|	ГрафикиРаботыСотрудниковСписокДней.КоличествоЧасов > 0
		|	И ГрафикиРаботыСотрудниковСписокДней.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	ДанныеГрафика = Запрос.Выполнить().Выгрузить();
	
    РегистрыСведений.ГрафикРаботыПредприятия.ЗаполнитьГрафики(ДанныеГрафика);
	
	СообщениеПользователю = Новый СообщениеПользователю;
	СообщениеПользователю.Текст = СтрШаблон("График работы %1 успешно загружен.", Объект.Наименование);
	СообщениеПользователю.Сообщить();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьВГрафикиПредприятия(Команда)
	Если Объект.СписокДней.Количество() > 0 Тогда 
		ЗагрузитьВГрафикиПредприятияНаСервере();
	Иначе
		Сообщить("График работы не содержит данных, нужно заполнить график работы!");
	КонецЕсли;
	
КонецПроцедуры
